app/Models/MLogin.php

    public function cek_login($user, $pass)
    {
        return $this->db->table('login')
            ->where(['username' => $user, 'password' => $pass])
            ->get()->getRowArray();
---
SELECT *
FROM `login`
WHERE `username` = 'RiskaS'
AND `password` = 'riska125'

    public function cek_login_sekertaris($user, $pass)
    {
        return $this->db->table('login')
            ->join('sekertaris', 'sekertaris.id_sekertaris = login.id_user')
            ->where(['username' => $user, 'password' => $pass])
            ->get()->getRowArray();
---
SELECT *
FROM `login`
JOIN `sekertaris` ON `sekertaris`.`id_sekertaris` = `login`.`id_user`
WHERE `username` = 'RiskaS'
AND `password` = 'riska125'

    public function cek_login_masyarakat($user, $pass)
    {
        return $this->db->table('login')
            ->join('masyarakat', 'masyarakat.id_masyarakat = login.id_user')
            ->where(['username' => $user, 'password' => $pass])
            ->get()->getRowArray();
---
SELECT *
FROM `login`
JOIN `masyarakat` ON `masyarakat`.`id_masyarakat` = `login`.`id_user`
WHERE `username` = 'RiskaS'
AND `password` = 'riska125'

    public function cek_login_lurah($user, $pass)
    {
        return $this->db->table('login')
            ->join('lurah', 'lurah.id_lurah = login.id_user')
            ->where(['username' => $user, 'password' => $pass])
            ->get()->getRowArray();
---
SELECT *
FROM `login`
JOIN `lurah` ON `lurah`.`id_lurah` = `login`.`id_user`
WHERE `username` = 'RiskaS'
AND `password` = 'riska125'