app/Models/MMasyarakat.php

SELECT *
FROM `masyarakat`
JOIN `login` ON `login`.`id_user`=`masyarakat`.`id_masyarakat`
WHERE `id_masyarakat` = 'MSY-20221028215638'
---
    public function tampilkan_data_profile($id)
    {
        return $this->db->table('masyarakat')
            ->join('login', 'login.id_user=masyarakat.id_masyarakat')
            ->where('id_masyarakat', $id)
            ->get()->getRowArray();

SELECT *
FROM `pengajuan_surat`
JOIN `surat` ON `surat`.`id_surat`=`pengajuan_surat`.`id_surat`
LEFT JOIN `sekertaris` ON `sekertaris`.`id_sekertaris`=`pengajuan_surat`.`acc_admin`
WHERE `pengajuan_surat`.`NIK` = '3072892323'
---
    public function tampilkan_data_pengajuan($id, $filter, $status)
    {
        if ($filter === null && $status === null) {
            return $this->db->table('pengajuan_surat')
                ->join('surat', 'surat.id_surat=pengajuan_surat.id_surat')
                ->join('sekertaris', 'sekertaris.id_sekertaris=pengajuan_surat.acc_admin', 'left')
                ->where('pengajuan_surat.NIK', $id)
                ->get()->getResultArray();

SELECT *
FROM `surat`
JOIN `syarat_surat` ON `syarat_surat`.`id_surat`=`surat`.`id_surat`
---
    public function tampilkan_data_surat()
    {
        return $this->db->table('surat')
            ->join('syarat_surat', 'syarat_surat.id_surat=surat.id_surat')
            ->get()->getResultArray();

INSERT INTO `pengajuan_surat` (`id_pengajuan_surat`, `NIK`, `id_surat`, `file`, `status`, `tipe_pengajuan`, `operator`) VALUES ('SRPJ-202388211840', '3072892323', 'SR-20221212141819', 'document.pdf', 'menunggu', 'mandiri', 'MSY-20221028215638')
---
    public function proses_tambah_pengajuan_surat_masyarakat($data)
    {
        return $this->db->table('pengajuan_surat')->insert($data);