app/Models/MSekertaris.php

INSERT INTO `masyarakat` (`id_masyarakat`, `nama_masyarakat`, `NIK`, `jenis_kelamin`, `tempat_lahir`, `tgl_lahir`, `agama`, `no_hp`, `email`, `alamat`) VALUES ('MSY-202381013523', 'Indra Kusnadi13', '17111000', 'Laki-laki', 'Tangerang', '2023-08-10', 'Protestan', '0938974298347', 'in@email.com', 'asdas')
---
    public function proses_tambah_data_pengguna($data)
    {
        return $this->db->table('masyarakat')->insert($data);

INSERT INTO `login` (`id_user`, `username`, `password`, `status_user`, `status_keaktifan`) VALUES ('MSY-2023812211812', '879791723', '879791723', 'masyarakat', 'aktif')
---
    public function proses_tambah_data_login_pengguna($data)
    {
        return $this->db->table('login')->insert($data);

INSERT INTO `pengajuan_surat` (`id_pengajuan_surat`, `NIK`, `id_surat`, `file`, `status`, `tipe_pengajuan`, `operator`) VALUES ('SRPJ-2023812211812', '879791723', 'SR-20221212141626', 'document (2)_1.pdf', 'disetujui', 'admin', 'SK001')
---
    public function proses_tambah_pengajuan_saya($data)
    {
        return $this->db->table('pengajuan_surat')->insert($data);

SELECT *
FROM `surat`
---
    public function tampilkan_data_surat()
    {
        return $this->db->table('surat')
            ->get()->getResultArray();

SELECT *
FROM `masyarakat`
JOIN `login` ON `login`.`id_user`=`masyarakat`.`id_masyarakat`
WHERE `status_keaktifan` = 'aktif'
---
    public function tampilkan_data_masyarakat()
    {
        return $this->db->table('masyarakat')
            ->join('login', 'login.id_user=masyarakat.id_masyarakat')
            ->where('status_keaktifan', 'aktif')
            ->get()->getResultArray();

SELECT *
FROM `pengajuan_surat`
JOIN `masyarakat` ON `masyarakat`.`NIK`=`pengajuan_surat`.`NIK`
JOIN `surat` ON `surat`.`id_surat`=`pengajuan_surat`.`id_surat`
WHERE `tipe_pengajuan` = 'mandiri'
---
    public function tampilkan_data_pengajuan_surat($filter)
    {
        if ($filter === null) {
            return $this->db->table('pengajuan_surat')
                ->join('masyarakat', 'masyarakat.NIK=pengajuan_surat.NIK')
                ->join('surat', 'surat.id_surat=pengajuan_surat.id_surat')
                ->where('tipe_pengajuan', 'mandiri')
                ->get()->getResultArray();

SELECT *
FROM `pengajuan_surat`
JOIN `masyarakat` ON `masyarakat`.`NIK`=`pengajuan_surat`.`NIK`
JOIN `surat` ON `surat`.`id_surat`=`pengajuan_surat`.`id_surat`
WHERE `tipe_pengajuan` = 'admin'
---
    public function tampilkan_data_pengajuan_saya()
    {
        return $this->db->table('pengajuan_surat')
            ->join('masyarakat', 'masyarakat.NIK=pengajuan_surat.NIK')
            ->join('surat', 'surat.id_surat=pengajuan_surat.id_surat')
            ->where('tipe_pengajuan', 'admin')
            ->get()->getResultArray();